{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# AOP-Wiki RDF statistics\n",
    "This Jupyter notebook executes a variety of SPARQL queries against the AOP-Wiki RDF, extracting numbers of annotations of every type, number of entities, identifier types, and identifier mappings.\n",
    "\n",
    "The notebook exists of 5 sections:\n",
    "- Section 1: Imports and setting base variables\n",
    "- Section 2: Metadata and general numbers of core AOP-Wiki RDF\n",
    "- Section 3: Ontology usage in the core AOP-Wiki RDF\n",
    "- Section 4: Identifier usage in the core AOP-Wiki RDF\n",
    "- Section 5: Additional text-mapped genes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 1: Imports, functions, and setting base variables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already up-to-date: pip in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (20.2.4)\n",
      "Requirement already satisfied: watermark in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (1.8.1)\n",
      "Requirement already satisfied: ipython in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from watermark) (7.6.1)\n",
      "Requirement already satisfied: jedi>=0.10 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (0.13.3)\n",
      "Requirement already satisfied: pickleshare in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (0.7.5)\n",
      "Requirement already satisfied: pexpect; sys_platform != \"win32\" in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (4.7.0)\n",
      "Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (2.0.9)\n",
      "Requirement already satisfied: backcall in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (0.1.0)\n",
      "Requirement already satisfied: setuptools>=18.5 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (41.0.1)\n",
      "Requirement already satisfied: decorator in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (4.4.0)\n",
      "Requirement already satisfied: pygments in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (2.4.2)\n",
      "Requirement already satisfied: traitlets>=4.2 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (4.3.2)\n",
      "Requirement already satisfied: parso>=0.3.0 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from jedi>=0.10->ipython->watermark) (0.5.0)\n",
      "Requirement already satisfied: ptyprocess>=0.5 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from pexpect; sys_platform != \"win32\"->ipython->watermark) (0.6.0)\n",
      "Requirement already satisfied: wcwidth in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython->watermark) (0.1.7)\n",
      "Requirement already satisfied: six>=1.9.0 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython->watermark) (1.12.0)\n",
      "Requirement already satisfied: ipython-genutils in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from traitlets>=4.2->ipython->watermark) (0.2.0)\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "\n",
    "!{sys.executable} -m pip install --upgrade pip \n",
    "!{sys.executable} -m pip install watermark\n",
    "\n",
    "try:\n",
    "    from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "except ImportError:\n",
    "    !{sys.executable} -m pip install sparqlwrapper\n",
    "    from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "try:\n",
    "    import pandas as pd\n",
    "except ImportError:\n",
    "    !{sys.executable} -m pip install pandas\n",
    "    import pandas as pd\n",
    "pd.set_option('display.max_colwidth', -1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def intersection(lst1, lst2): \n",
    "    lst3 = [value for value in lst1 if value in lst2] \n",
    "    return lst3 "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "AOPWikiSPARQL = SPARQLWrapper(\"http://aopwiki-rdf.prod.openrisknet.org/sparql/\")\n",
    "AOPWikiSPARQL.setReturnFormat(JSON) \n",
    "#core ontologies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "triple = ['subject','predicate','object']\n",
    "coretypes = ['aopo:AdverseOutcomePathway','aopo:KeyEvent','aopo:KeyEventRelationship','ncbitaxon:131567','go:0008150','pato:0001241','pato:0000001','aopo:CellTypeContext','aopo:OrganContext','nci:C54571','cheminf:000000'] \n",
    "ontologies = ['http://aopkb.org/aop_ontology#','http://edamontology.org/','http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#','http://purl.bioontology.org/ontology/NCBITAXON/','http://purl.obolibrary.org/obo/MMO','http://purl.obolibrary.org/obo/CL_','http://purl.obolibrary.org/obo/UBERON_','http://purl.obolibrary.org/obo/MI_','http://purl.obolibrary.org/obo/MP_','http://purl.org/commons/record/mesh/','http://purl.obolibrary.org/obo/HP_','http://purl.obolibrary.org/obo/PCO_','http://purl.obolibrary.org/obo/NBO_','http://purl.obolibrary.org/obo/VT_','http://purl.obolibrary.org/obo/PR_','http://purl.obolibrary.org/obo/CHEBI_','http://purl.org/sig/ont/fma/fma','http://xmlns.com/foaf/0.1/','http://www.w3.org/2004/02/skos/core#','http://www.w3.org/2000/01/rdf-schema#','http://www.w3.org/1999/02/22-rdf-syntax-ns#','http://semanticscience.org/resource/CHEMINF_','http://purl.org/obo/owl/GO','http://purl.org/dc/terms/','http://purl.org/dc/elements/1.1/','http://purl.obolibrary.org/obo/PATO_']\n",
    "identifiers = []"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 2: Metadata and general numbers of core AOP-Wiki RDF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 115247 triples\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select (COUNT(distinct *) as ?Triples)  where {?s ?p ?o}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    x = result[\"Triples\"][\"value\"]\n",
    "\n",
    "print(\"The AOP-Wiki RDF has \" + str(x) + \" triples\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 14727 subjects\n",
      "The AOP-Wiki RDF has 156 predicates\n",
      "The AOP-Wiki RDF has 51131 objects\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select (COUNT(distinct ?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" \" + item + \"s\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 3: Ontology usage in the core AOP-Wiki RDF\n",
    "\n",
    "### AOP Ontology"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 0 subjects with the AOP Ontology\n",
      "The AOP-Wiki RDF has 8615 predicates with the AOP Ontology\n",
      "The AOP-Wiki RDF has 2886 objects with the AOP Ontology\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select  (COUNT(?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?''' + item + ''', \"http://aopkb.org/aop_ontology#\")}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        n = int(result[\"Entity\"][\"value\"])\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(n) + \" \" + item + \"s with the AOP Ontology\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 0 distinct subject annotations with the AOP Ontology\n",
      "The AOP-Wiki RDF has 12 distinct predicate annotations with the AOP Ontology\n",
      "The AOP-Wiki RDF has 5 distinct object annotations with the AOP Ontology\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select (COUNT(DISTINCT ?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?''' + item + ''', \"http://aopkb.org/aop_ontology#\")}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" distinct \" + item + \" annotations with the AOP Ontology\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 306 Subjects of type: aopo:AdverseOutcomePathway\n",
      "The AOP-Wiki RDF has 1118 Subjects of type: aopo:KeyEvent\n",
      "The AOP-Wiki RDF has 1338 Subjects of type: aopo:KeyEventRelationship\n",
      "The AOP-Wiki RDF has 99 Subjects of type: ncbitaxon:131567\n",
      "The AOP-Wiki RDF has 367 Subjects of type: go:0008150\n",
      "The AOP-Wiki RDF has 370 Subjects of type: pato:0001241\n",
      "The AOP-Wiki RDF has 0 Subjects of type: pato:0000001\n",
      "The AOP-Wiki RDF has 60 Subjects of type: aopo:CellTypeContext\n",
      "The AOP-Wiki RDF has 64 Subjects of type: aopo:OrganContext\n",
      "The AOP-Wiki RDF has 499 Subjects of type: nci:C54571\n",
      "The AOP-Wiki RDF has 317 Subjects of type: cheminf:000000\n"
     ]
    }
   ],
   "source": [
    "for item in coretypes:\n",
    "    sparqlquery = '''select (COUNT(DISTINCT ?subject) as ?Entity)  where {?subject a ''' + item + '''.}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" Subjects of type: \" + item)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All ontologies used for predicate annotation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:AdverseOutcomePathway subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#AopContext</td>\n",
       "      <td>77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://aopkb.org/aop_ontology#LifeStageContext</td>\n",
       "      <td>146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_adverse_outcome</td>\n",
       "      <td>273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_evidence</td>\n",
       "      <td>67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_key_event</td>\n",
       "      <td>284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_key_event_relationship</td>\n",
       "      <td>262</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_molecular_initiating_event</td>\n",
       "      <td>256</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://edamontology.org/operation_3799</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25217</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25725</td>\n",
       "      <td>56</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C48192</td>\n",
       "      <td>69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571</td>\n",
       "      <td>129</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000047</td>\n",
       "      <td>159</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/creator</td>\n",
       "      <td>246</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>159</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>http://purl.org/dc/terms/abstract</td>\n",
       "      <td>164</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>http://purl.org/dc/terms/alternative</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>http://purl.org/dc/terms/created</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>http://purl.org/dc/terms/modified</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>306</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                       predicate  \\\n",
       "0   http://aopkb.org/aop_ontology#AopContext                       \n",
       "1   http://aopkb.org/aop_ontology#LifeStageContext                 \n",
       "2   http://aopkb.org/aop_ontology#has_adverse_outcome              \n",
       "3   http://aopkb.org/aop_ontology#has_evidence                     \n",
       "4   http://aopkb.org/aop_ontology#has_key_event                    \n",
       "5   http://aopkb.org/aop_ontology#has_key_event_relationship       \n",
       "6   http://aopkb.org/aop_ontology#has_molecular_initiating_event   \n",
       "7   http://edamontology.org/operation_3799                         \n",
       "8   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25217      \n",
       "9   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25725      \n",
       "10  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C48192      \n",
       "11  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571      \n",
       "12  http://purl.obolibrary.org/obo/PATO_0000047                    \n",
       "13  http://purl.org/dc/elements/1.1/creator                        \n",
       "14  http://purl.org/dc/elements/1.1/description                    \n",
       "15  http://purl.org/dc/elements/1.1/identifier                     \n",
       "16  http://purl.org/dc/elements/1.1/source                         \n",
       "17  http://purl.org/dc/elements/1.1/title                          \n",
       "18  http://purl.org/dc/terms/abstract                              \n",
       "19  http://purl.org/dc/terms/alternative                           \n",
       "20  http://purl.org/dc/terms/created                               \n",
       "21  http://purl.org/dc/terms/modified                              \n",
       "22  http://www.w3.org/1999/02/22-rdf-syntax-ns#type                \n",
       "23  http://www.w3.org/2000/01/rdf-schema#label                     \n",
       "24  http://xmlns.com/foaf/0.1/page                                 \n",
       "\n",
       "   # of times used  \n",
       "0   77              \n",
       "1   146             \n",
       "2   273             \n",
       "3   67              \n",
       "4   284             \n",
       "5   262             \n",
       "6   256             \n",
       "7   60              \n",
       "8   79              \n",
       "9   56              \n",
       "10  69              \n",
       "11  129             \n",
       "12  159             \n",
       "13  246             \n",
       "14  159             \n",
       "15  306             \n",
       "16  306             \n",
       "17  306             \n",
       "18  164             \n",
       "19  306             \n",
       "20  306             \n",
       "21  306             \n",
       "22  306             \n",
       "23  306             \n",
       "24  306             "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:KeyEvent subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#CellTypeContext</td>\n",
       "      <td>348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://aopkb.org/aop_ontology#LifeStageContext</td>\n",
       "      <td>192</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://aopkb.org/aop_ontology#OrganContext</td>\n",
       "      <td>213</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://edamontology.org/data_1025</td>\n",
       "      <td>141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25664</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571</td>\n",
       "      <td>155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/131567</td>\n",
       "      <td>247</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MMO_0000000</td>\n",
       "      <td>342</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000001</td>\n",
       "      <td>730</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000047</td>\n",
       "      <td>189</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0001241</td>\n",
       "      <td>542</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>371</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://purl.org/dc/terms/alternative</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://purl.org/obo/owl/GO#0008150</td>\n",
       "      <td>606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>1118</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    predicate # of times used\n",
       "0   http://aopkb.org/aop_ontology#CellTypeContext              348           \n",
       "1   http://aopkb.org/aop_ontology#LifeStageContext             192           \n",
       "2   http://aopkb.org/aop_ontology#OrganContext                 213           \n",
       "3   http://edamontology.org/data_1025                          141           \n",
       "4   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25664  1118          \n",
       "5   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571  155           \n",
       "6   http://purl.bioontology.org/ontology/NCBITAXON/131567      247           \n",
       "7   http://purl.obolibrary.org/obo/MMO_0000000                 342           \n",
       "8   http://purl.obolibrary.org/obo/PATO_0000001                730           \n",
       "9   http://purl.obolibrary.org/obo/PATO_0000047                189           \n",
       "10  http://purl.obolibrary.org/obo/PATO_0001241                542           \n",
       "11  http://purl.org/dc/elements/1.1/description                371           \n",
       "12  http://purl.org/dc/elements/1.1/identifier                 1118          \n",
       "13  http://purl.org/dc/elements/1.1/source                     1118          \n",
       "14  http://purl.org/dc/elements/1.1/title                      1118          \n",
       "15  http://purl.org/dc/terms/alternative                       1118          \n",
       "16  http://purl.org/dc/terms/isPartOf                          1118          \n",
       "17  http://purl.org/obo/owl/GO#0008150                         606           \n",
       "18  http://www.w3.org/1999/02/22-rdf-syntax-ns#type            1118          \n",
       "19  http://www.w3.org/2000/01/rdf-schema#label                 1118          \n",
       "20  http://xmlns.com/foaf/0.1/page                             1118          "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:KeyEventRelationship subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#LifeStageContext</td>\n",
       "      <td>202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_downstream_key_event</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_upstream_key_event</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://edamontology.org/data_1025</td>\n",
       "      <td>315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://edamontology.org/data_2042</td>\n",
       "      <td>353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C71478</td>\n",
       "      <td>305</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C80263</td>\n",
       "      <td>365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/131567</td>\n",
       "      <td>230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000047</td>\n",
       "      <td>208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.org/dc/terms/created</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/dc/terms/modified</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>1338</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    predicate # of times used\n",
       "0   http://aopkb.org/aop_ontology#LifeStageContext             202           \n",
       "1   http://aopkb.org/aop_ontology#has_downstream_key_event     1338          \n",
       "2   http://aopkb.org/aop_ontology#has_upstream_key_event       1338          \n",
       "3   http://edamontology.org/data_1025                          315           \n",
       "4   http://edamontology.org/data_2042                          353           \n",
       "5   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C71478  305           \n",
       "6   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C80263  365           \n",
       "7   http://purl.bioontology.org/ontology/NCBITAXON/131567      230           \n",
       "8   http://purl.obolibrary.org/obo/PATO_0000047                208           \n",
       "9   http://purl.org/dc/elements/1.1/description                363           \n",
       "10  http://purl.org/dc/elements/1.1/identifier                 1338          \n",
       "11  http://purl.org/dc/terms/created                           1338          \n",
       "12  http://purl.org/dc/terms/isPartOf                          1338          \n",
       "13  http://purl.org/dc/terms/modified                          1338          \n",
       "14  http://www.w3.org/1999/02/22-rdf-syntax-ns#type            1338          \n",
       "15  http://www.w3.org/2000/01/rdf-schema#label                 1338          \n",
       "16  http://xmlns.com/foaf/0.1/page                             1338          "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of ncbitaxon:131567 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>99</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>99</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>99</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>99</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       99            \n",
       "1  http://purl.org/dc/elements/1.1/source           99            \n",
       "2  http://purl.org/dc/elements/1.1/title            99            \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  99            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of go:0008150 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>367</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>367</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>367</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>367</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       367           \n",
       "1  http://purl.org/dc/elements/1.1/source           367           \n",
       "2  http://purl.org/dc/elements/1.1/title            367           \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  367           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of pato:0001241 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.w3.org/2004/02/skos/core#exactMatch</td>\n",
       "      <td>126</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       370           \n",
       "1  http://purl.org/dc/elements/1.1/source           370           \n",
       "2  http://purl.org/dc/elements/1.1/title            370           \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  370           \n",
       "4  http://www.w3.org/2004/02/skos/core#exactMatch   126           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of pato:0000001 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [predicate, # of times used]\n",
       "Index: []"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:CellTypeContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       60            \n",
       "1  http://purl.org/dc/elements/1.1/source           60            \n",
       "2  http://purl.org/dc/elements/1.1/title            60            \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  60            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:OrganContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       64            \n",
       "1  http://purl.org/dc/elements/1.1/source           64            \n",
       "2  http://purl.org/dc/elements/1.1/title            64            \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  64            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of nci:C54571 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_chemical_entity</td>\n",
       "      <td>320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.org/dc/terms/created</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.org/dc/terms/modified</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>499</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           predicate # of times used\n",
       "0  http://aopkb.org/aop_ontology#has_chemical_entity  320           \n",
       "1  http://purl.org/dc/elements/1.1/description        10            \n",
       "2  http://purl.org/dc/elements/1.1/identifier         499           \n",
       "3  http://purl.org/dc/elements/1.1/title              499           \n",
       "4  http://purl.org/dc/terms/created                   499           \n",
       "5  http://purl.org/dc/terms/isPartOf                  499           \n",
       "6  http://purl.org/dc/terms/modified                  499           \n",
       "7  http://www.w3.org/1999/02/22-rdf-syntax-ns#type    499           \n",
       "8  http://www.w3.org/2000/01/rdf-schema#label         499           \n",
       "9  http://xmlns.com/foaf/0.1/page                     499           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of cheminf:000000 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.org/dc/terms/alternative</td>\n",
       "      <td>266</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_000059</td>\n",
       "      <td>308</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_000446</td>\n",
       "      <td>317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_000568</td>\n",
       "      <td>317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://www.w3.org/2004/02/skos/core#exactMatch</td>\n",
       "      <td>315</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier          317           \n",
       "1  http://purl.org/dc/elements/1.1/source              317           \n",
       "2  http://purl.org/dc/elements/1.1/title               317           \n",
       "3  http://purl.org/dc/terms/alternative                266           \n",
       "4  http://purl.org/dc/terms/isPartOf                   317           \n",
       "5  http://semanticscience.org/resource/CHEMINF_000059  308           \n",
       "6  http://semanticscience.org/resource/CHEMINF_000446  317           \n",
       "7  http://semanticscience.org/resource/CHEMINF_000568  317           \n",
       "8  http://www.w3.org/1999/02/22-rdf-syntax-ns#type     317           \n",
       "9  http://www.w3.org/2004/02/skos/core#exactMatch      315           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "predicatedict = {}\n",
    "for item in coretypes:\n",
    "    predicates = pd.DataFrame(columns=['predicate','# of times used'])\n",
    "    sparqlquery = '''select distinct ?predicate (COUNT(distinct ?subject) as ?Entity)  where {?subject ?predicate ?object; a '''+item+'''.}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "    print(\"Predicates for triples of \"+item+\" subjects\")\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        predicates = predicates.append({\n",
    "            '# of times used' : result[\"Entity\"][\"value\"],\n",
    "            'predicate' : result[\"predicate\"][\"value\"],\n",
    "           # 'Chemical': result[\"Chemical\"][\"value\"] if ('Chemical' in result'),\n",
    "        }, ignore_index=True)\n",
    "        if not item in predicatedict:\n",
    "            predicatedict[item] = int(result[\"Entity\"][\"value\"])\n",
    "        else:\n",
    "            predicatedict[item] += int(result[\"Entity\"][\"value\"])\n",
    "    display(predicates.sort_values(by=['predicate']).reset_index(drop=True))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All predicate annotations combined"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>number of properties</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>aopo:AdverseOutcomePathway</td>\n",
       "      <td>8184</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>aopo:CellTypeContext</td>\n",
       "      <td>261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>aopo:KeyEvent</td>\n",
       "      <td>15556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>aopo:KeyEventRelationship</td>\n",
       "      <td>15881</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>aopo:OrganContext</td>\n",
       "      <td>258</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>cheminf:CHEMINF_000000</td>\n",
       "      <td>9869</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>go:0008150</td>\n",
       "      <td>1417</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ncbitaxon:131567</td>\n",
       "      <td>373</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>nci:C54571</td>\n",
       "      <td>4821</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>pato:PATO_0001241</td>\n",
       "      <td>2046</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      subject  number of properties\n",
       "0  aopo:AdverseOutcomePathway  8184                \n",
       "1  aopo:CellTypeContext        261                 \n",
       "2  aopo:KeyEvent               15556               \n",
       "3  aopo:KeyEventRelationship   15881               \n",
       "4  aopo:OrganContext           258                 \n",
       "5  cheminf:CHEMINF_000000      9869                \n",
       "6  go:0008150                  1417                \n",
       "7  ncbitaxon:131567            373                 \n",
       "8  nci:C54571                  4821                \n",
       "9  pato:PATO_0001241           2046                "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "predicatedf = pd.DataFrame(list(predicatedict.items()), columns=['subject', 'number of properties']).sort_values(by=['subject']).reset_index(drop=True)\n",
    "display(predicatedf)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All ontologies used for object annotation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:AdverseOutcomePathway subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>280</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           object # of times used\n",
       "0  http://aopkb.org/aop_ontology#  280           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:KeyEvent subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>1080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>410</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_</td>\n",
       "      <td>148</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>403</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MI_</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/NBO_</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PR_</td>\n",
       "      <td>199</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>239</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.obolibrary.org/obo/VT_</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/obo/owl/GO</td>\n",
       "      <td>515</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.org/sig/ont/fma/fma</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             object # of times used\n",
       "0   http://aopkb.org/aop_ontology#                   1080          \n",
       "1   http://purl.bioontology.org/ontology/NCBITAXON/  410           \n",
       "2   http://purl.obolibrary.org/obo/CHEBI_            148           \n",
       "3   http://purl.obolibrary.org/obo/CL_               403           \n",
       "4   http://purl.obolibrary.org/obo/HP_               8             \n",
       "5   http://purl.obolibrary.org/obo/MI_               7             \n",
       "6   http://purl.obolibrary.org/obo/MP_               77            \n",
       "7   http://purl.obolibrary.org/obo/NBO_              10            \n",
       "8   http://purl.obolibrary.org/obo/PCO_              8             \n",
       "9   http://purl.obolibrary.org/obo/PR_               199           \n",
       "10  http://purl.obolibrary.org/obo/UBERON_           239           \n",
       "11  http://purl.obolibrary.org/obo/VT_               9             \n",
       "12  http://purl.org/commons/record/mesh/             140           \n",
       "13  http://purl.org/obo/owl/GO                       515           \n",
       "14  http://purl.org/sig/ont/fma/fma                  12            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:KeyEventRelationship subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>1259</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>333</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            object # of times used\n",
       "0  http://aopkb.org/aop_ontology#                   1259          \n",
       "1  http://purl.bioontology.org/ontology/NCBITAXON/  333           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of ncbitaxon:131567 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>176</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            object # of times used\n",
       "0  http://purl.bioontology.org/ontology/NCBITAXON/  176           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of go:0008150 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MI_</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>53</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/NBO_</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/VT_</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.org/obo/owl/GO</td>\n",
       "      <td>600</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 object # of times used\n",
       "0  http://purl.obolibrary.org/obo/HP_    6             \n",
       "1  http://purl.obolibrary.org/obo/MI_    5             \n",
       "2  http://purl.obolibrary.org/obo/MP_    53            \n",
       "3  http://purl.obolibrary.org/obo/NBO_   7             \n",
       "4  http://purl.obolibrary.org/obo/PATO_  5             \n",
       "5  http://purl.obolibrary.org/obo/PCO_   1             \n",
       "6  http://purl.obolibrary.org/obo/VT_    7             \n",
       "7  http://purl.org/commons/record/mesh/  27            \n",
       "8  http://purl.org/obo/owl/GO            600           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of pato:PATO_0001241 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_</td>\n",
       "      <td>69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PR_</td>\n",
       "      <td>140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.org/obo/owl/GO</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.org/sig/ont/fma/fma</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    object # of times used\n",
       "0   http://aopkb.org/aop_ontology#          39            \n",
       "1   http://purl.obolibrary.org/obo/CHEBI_   69            \n",
       "2   http://purl.obolibrary.org/obo/CL_      38            \n",
       "3   http://purl.obolibrary.org/obo/MP_      1             \n",
       "4   http://purl.obolibrary.org/obo/PATO_    358           \n",
       "5   http://purl.obolibrary.org/obo/PCO_     2             \n",
       "6   http://purl.obolibrary.org/obo/PR_      140           \n",
       "7   http://purl.obolibrary.org/obo/UBERON_  32            \n",
       "8   http://purl.org/commons/record/mesh/    47            \n",
       "9   http://purl.org/obo/owl/GO              26            \n",
       "10  http://purl.org/sig/ont/fma/fma         8             "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of pato:PATO_0000001 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [object, # of times used]\n",
       "Index: []"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:CellTypeContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 object # of times used\n",
       "0  http://aopkb.org/aop_ontology#        59            \n",
       "1  http://purl.obolibrary.org/obo/CL_    59            \n",
       "2  http://purl.obolibrary.org/obo/PATO_  25            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:OrganContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   object # of times used\n",
       "0  http://aopkb.org/aop_ontology#          61            \n",
       "1  http://purl.obolibrary.org/obo/PATO_    14            \n",
       "2  http://purl.obolibrary.org/obo/UBERON_  61            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of nci:C54571 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#</td>\n",
       "      <td>454</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                object # of times used\n",
       "0  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#  454           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of cheminf:CHEMINF_000000 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_</td>\n",
       "      <td>586</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         object # of times used\n",
       "0  http://semanticscience.org/resource/CHEMINF_  586           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "objectdict = {}\n",
    "for item in coretypes:\n",
    "    objects = pd.DataFrame(columns=['object','# of times used'])\n",
    "    print(\"objects for triples of \"+item+\" subjects\")\n",
    "    for onto in ontologies:\n",
    "        n=0\n",
    "        sparqlquery = '''select (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object; a '''+item+'''. FILTER regex(?object, \"'''+onto+'''\")}'''\n",
    "        AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "        results = AOPWikiSPARQL.query().convert()\n",
    "        \n",
    "        for result in results[\"results\"][\"bindings\"]:\n",
    "            n+=int(result[\"Entity\"][\"value\"])\n",
    "            \n",
    "            \n",
    "        if n != 0:\n",
    "            objects = objects.append({\n",
    "                '# of times used' : n,\n",
    "                'object' : onto,\n",
    "               # 'Chemical': result[\"Chemical\"][\"value\"] if ('Chemical' in result'),\n",
    "            }, ignore_index=True)\n",
    "            if not onto in objectdict:\n",
    "                objectdict[onto] = n\n",
    "            else:\n",
    "                objectdict[onto] += n\n",
    "    display(objects.sort_values(by=['object']).reset_index(drop=True))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All object annotations combined"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th>number</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>2778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#</td>\n",
       "      <td>454</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>919</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_</td>\n",
       "      <td>217</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MI_</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/NBO_</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>402</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PR_</td>\n",
       "      <td>339</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>332</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.obolibrary.org/obo/VT_</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://purl.org/obo/owl/GO</td>\n",
       "      <td>1141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://purl.org/sig/ont/fma/fma</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_</td>\n",
       "      <td>586</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 object  number\n",
       "0   http://aopkb.org/aop_ontology#                       2778  \n",
       "1   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#  454   \n",
       "2   http://purl.bioontology.org/ontology/NCBITAXON/      919   \n",
       "3   http://purl.obolibrary.org/obo/CHEBI_                217   \n",
       "4   http://purl.obolibrary.org/obo/CL_                   500   \n",
       "5   http://purl.obolibrary.org/obo/HP_                   14    \n",
       "6   http://purl.obolibrary.org/obo/MI_                   12    \n",
       "7   http://purl.obolibrary.org/obo/MP_                   131   \n",
       "8   http://purl.obolibrary.org/obo/NBO_                  17    \n",
       "9   http://purl.obolibrary.org/obo/PATO_                 402   \n",
       "10  http://purl.obolibrary.org/obo/PCO_                  11    \n",
       "11  http://purl.obolibrary.org/obo/PR_                   339   \n",
       "12  http://purl.obolibrary.org/obo/UBERON_               332   \n",
       "13  http://purl.obolibrary.org/obo/VT_                   16    \n",
       "14  http://purl.org/commons/record/mesh/                 214   \n",
       "15  http://purl.org/obo/owl/GO                           1141  \n",
       "16  http://purl.org/sig/ont/fma/fma                      20    \n",
       "17  http://semanticscience.org/resource/CHEMINF_         586   "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "objectdf = pd.DataFrame(list(objectdict.items()), columns=['object', 'number']).sort_values(by=['object']).reset_index(drop=True)\n",
    "display(objectdf)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 4: Identifier usage in the core AOP-Wiki RDF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 57375 subjects with a persistent identifier\n",
      "The AOP-Wiki RDF has 0 predicates with a persistent identifier\n",
      "The AOP-Wiki RDF has 20096 objects with a persistent identifier\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select (COUNT(?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?''' + item + ''', \"http://identifiers.org/\")}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" \" + item + \"s with a persistent identifier\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### BridgeDb mappings for chemical identifiers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BridgeDb has mapped chemicals with identifiers from 8 distinct databases\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select distinct ?type where {?s a cheminf:CHEMINF_000000; skos:exactMatch ?o. ?o a ?type}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "y = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    y.append(result[\"type\"][\"value\"])\n",
    "\n",
    "print(\"BridgeDb has mapped chemicals with identifiers from \" + str(len(y)) + \" distinct databases\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 712 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000407\n",
      "The AOP-Wiki RDF has 257 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000412\n",
      "The AOP-Wiki RDF has 303 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000405\n",
      "The AOP-Wiki RDF has 146 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000406\n",
      "The AOP-Wiki RDF has 319 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000408\n",
      "The AOP-Wiki RDF has 24 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000564\n",
      "The AOP-Wiki RDF has 299 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000140\n",
      "The AOP-Wiki RDF has 293 chemicals mapped using BridgeDb of type: http://semanticscience.org/resource/CHEMINF_000567\n"
     ]
    }
   ],
   "source": [
    "for item in y:\n",
    "    sparqlquery = '''select (COUNT(?subject) as ?Entity)  where {?subject a <''' + item + '''>}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" chemicals mapped using BridgeDb of type: \" + item)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Protein Ontology mappings to gene/protein identifiers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 163 Key Events that are annotated with 124 Protein Ontology annotation, which are mapped to gene identifiers from 4 distinct databases\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select distinct ?s0 ?s ?type where {?s0 a aopo:KeyEvent; pato:PATO_0001241 ?s. ?s a pato:PATO_0001241; skos:exactMatch ?o. ?o a ?type}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "y = []\n",
    "x = []\n",
    "z = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    y.append(result[\"type\"][\"value\"])\n",
    "    x.append(result[\"s\"][\"value\"])\n",
    "    z.append(result[\"s0\"][\"value\"])\n",
    "y = set(y)\n",
    "x = set(x)\n",
    "z = set(z)\n",
    "print(\"The AOP-Wiki RDF has \" + str(len(z)) + \" Key Events that are annotated with \" + str(len(x)) + \" Protein Ontology annotation, which are mapped to gene identifiers from \" + str(len(y)) + \" distinct databases\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 95 genes mapped to Protein Ontology terms for database identifier type: http://edamontology.org/data_2298\n",
      "The AOP-Wiki RDF has 443 genes mapped to Protein Ontology terms for database identifier type: http://edamontology.org/data_2291\n",
      "The AOP-Wiki RDF has 570 genes mapped to Protein Ontology terms for database identifier type: http://edamontology.org/data_1025\n",
      "The AOP-Wiki RDF has 32 genes mapped to Protein Ontology terms for database identifier type: http://edamontology.org/data_1027\n"
     ]
    }
   ],
   "source": [
    "for item in y:\n",
    "    sparqlquery = '''select (COUNT(distinct ?s2) as ?Entity)  where {?s a pato:PATO_0001241; skos:exactMatch ?s2. ?s2 ?p ?o; a <''' + item + '''>}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" genes mapped to Protein Ontology terms for database identifier type: \" + item)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 5: Additional text-mapped genes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has a total of 284 distinct genes mapped to 132 Key Event descriptions\n",
      "The AOP-Wiki RDF has a total of 709 distinct genes mapped to 294 Key Event Relationship descriptions\n",
      "There are 197 genes mapped at least once to both Key Events and Key Event Relationships\n",
      "There are 796 unique genes mapped to Key Events and/or Key Event Relationships\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select distinct ?s ?s2 where {?s a aopo:KeyEvent; edam:data_1025 ?s2.}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "y = []\n",
    "z = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    y.append(result[\"s2\"][\"value\"])\n",
    "    z.append(result[\"s\"][\"value\"])\n",
    "y = set(y)\n",
    "z = set(z)\n",
    "\n",
    "sparqlquery = '''select distinct ?s ?s2 where {?s a aopo:KeyEventRelationship; edam:data_1025 ?s2.}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "w = []\n",
    "x = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    w.append(result[\"s2\"][\"value\"])\n",
    "    x.append(result[\"s\"][\"value\"])\n",
    "w = set(w)\n",
    "x = set(x)\n",
    "\n",
    "print(\"The AOP-Wiki RDF has a total of \" + str(len(y)) + \" distinct genes mapped to \" + str(len(z)) + \" Key Event descriptions\")\n",
    "print(\"The AOP-Wiki RDF has a total of \" + str(len(w)) + \" distinct genes mapped to \" + str(len(x)) + \" Key Event Relationship descriptions\")\n",
    "print(\"There are \" + str(len(intersection(w,y))) + \" genes mapped at least once to both Key Events and Key Event Relationships\")\n",
    "print(\"There are \" + str(len(w|y)) + \" unique genes mapped to Key Events and/or Key Event Relationships\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Dublin core\n",
    "select (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object.FILTER regex(?predicate, \"http://purl.org/dc/\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# a\n",
    "select  (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"http://www.w3.org/1999/02/22-rdf-syntax-ns\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#rdf schema\n",
    "select  (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"http://www.w3.org/2000/01/rdf-schema\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# foaf\n",
    "select  (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"http://xmlns.com/foaf/0.1\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#aopo predicate\n",
    "select  distinct ?predicate \n",
    "(COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"ttp://aopkb.org/aop_ontology#\")}"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
