{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# AOP-Wiki RDF statistics\n",
    "This Jupyter notebook executes a variety of SPARQL queries against the AOP-Wiki RDF, extracting numbers of annotations of every type, number of entities, identifier types, and identifier mappings.\n",
    "\n",
    "The notebook exists of 5 sections:\n",
    "- Section 1: Imports and setting base variables\n",
    "- Section 2: Metadata and general numbers of core AOP-Wiki RDF\n",
    "- Section 3: Ontology usage in the core AOP-Wiki RDF\n",
    "- Section 4: Identifier usage in the core AOP-Wiki RDF\n",
    "- Section 5: Additional text-mapped genes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 1: Imports, functions, and setting base variables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: pip in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (21.0.1)\n",
      "Requirement already satisfied: watermark in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (1.8.1)\n",
      "Requirement already satisfied: ipython in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from watermark) (7.6.1)\n",
      "Requirement already satisfied: pickleshare in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (0.7.5)\n",
      "Requirement already satisfied: decorator in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (4.4.0)\n",
      "Requirement already satisfied: jedi>=0.10 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (0.13.3)\n",
      "Requirement already satisfied: backcall in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (0.1.0)\n",
      "Requirement already satisfied: pexpect in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (4.7.0)\n",
      "Requirement already satisfied: pygments in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (2.4.2)\n",
      "Requirement already satisfied: setuptools>=18.5 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (41.0.1)\n",
      "Requirement already satisfied: traitlets>=4.2 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (4.3.2)\n",
      "Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from ipython->watermark) (2.0.9)\n",
      "Requirement already satisfied: parso>=0.3.0 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from jedi>=0.10->ipython->watermark) (0.5.0)\n",
      "Requirement already satisfied: wcwidth in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython->watermark) (0.1.7)\n",
      "Requirement already satisfied: six>=1.9.0 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython->watermark) (1.12.0)\n",
      "Requirement already satisfied: ipython-genutils in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from traitlets>=4.2->ipython->watermark) (0.2.0)\n",
      "Requirement already satisfied: ptyprocess>=0.5 in /home/marvin.martens/anaconda3/lib/python3.7/site-packages (from pexpect->ipython->watermark) (0.6.0)\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "\n",
    "!{sys.executable} -m pip install --upgrade pip \n",
    "!{sys.executable} -m pip install watermark\n",
    "\n",
    "try:\n",
    "    from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "except ImportError:\n",
    "    !{sys.executable} -m pip install sparqlwrapper\n",
    "    from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "try:\n",
    "    import pandas as pd\n",
    "except ImportError:\n",
    "    !{sys.executable} -m pip install pandas\n",
    "    import pandas as pd\n",
    "pd.set_option('display.max_colwidth', -1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def intersection(lst1, lst2): \n",
    "    lst3 = [value for value in lst1 if value in lst2] \n",
    "    return lst3 "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "AOPWikiSPARQL = SPARQLWrapper(\"https://aopwiki.rdf.bigcat-bioinformatics.org/sparql/\")\n",
    "AOPWikiSPARQL.setReturnFormat(JSON) \n",
    "#core ontologies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "triple = ['subject','predicate','object']\n",
    "coretypes = ['aopo:AdverseOutcomePathway','aopo:KeyEvent','aopo:KeyEventRelationship','ncbitaxon:131567','go:0008150','pato:0001241','pato:0000001','aopo:CellTypeContext','aopo:OrganContext','nci:C54571','cheminf:000000'] \n",
    "ontologies = ['http://aopkb.org/aop_ontology#','http://edamontology.org/','http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#','http://purl.bioontology.org/ontology/NCBITAXON/','http://purl.obolibrary.org/obo/MMO','http://purl.obolibrary.org/obo/CL_','http://purl.obolibrary.org/obo/UBERON_','http://purl.obolibrary.org/obo/MI_','http://purl.obolibrary.org/obo/MP_','http://purl.org/commons/record/mesh/','http://purl.obolibrary.org/obo/HP_','http://purl.obolibrary.org/obo/PCO_','http://purl.obolibrary.org/obo/NBO_','http://purl.obolibrary.org/obo/VT_','http://purl.obolibrary.org/obo/PR_','http://purl.obolibrary.org/obo/CHEBI_','http://purl.org/sig/ont/fma/fma','http://xmlns.com/foaf/0.1/','http://www.w3.org/2004/02/skos/core#','http://www.w3.org/2000/01/rdf-schema#','http://www.w3.org/1999/02/22-rdf-syntax-ns#','http://semanticscience.org/resource/CHEMINF_','http://purl.obolibrary.org/obo/GO_','http://purl.org/dc/terms/','http://purl.org/dc/elements/1.1/','http://purl.obolibrary.org/obo/PATO_']\n",
    "identifiers = []"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 2: Metadata and general numbers of core AOP-Wiki RDF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 122576 triples\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select (COUNT(distinct *) as ?Triples)  where {?s ?p ?o}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    x = result[\"Triples\"][\"value\"]\n",
    "\n",
    "print(\"The AOP-Wiki RDF has \" + str(x) + \" triples\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 15132 subjects\n",
      "The AOP-Wiki RDF has 158 predicates\n",
      "The AOP-Wiki RDF has 53087 objects\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select (COUNT(distinct ?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" \" + item + \"s\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 3: Ontology usage in the core AOP-Wiki RDF\n",
    "\n",
    "### AOP Ontology"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 5 subjects with the AOP Ontology\n",
      "The AOP-Wiki RDF has 8913 predicates with the AOP Ontology\n",
      "The AOP-Wiki RDF has 2937 objects with the AOP Ontology\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select  (COUNT(?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?''' + item + ''', \"http://aopkb.org/aop_ontology#\")}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        n = int(result[\"Entity\"][\"value\"])\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(n) + \" \" + item + \"s with the AOP Ontology\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 5 distinct subject annotations with the AOP Ontology\n",
      "The AOP-Wiki RDF has 12 distinct predicate annotations with the AOP Ontology\n",
      "The AOP-Wiki RDF has 5 distinct object annotations with the AOP Ontology\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select (COUNT(DISTINCT ?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?''' + item + ''', \"http://aopkb.org/aop_ontology#\")}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" distinct \" + item + \" annotations with the AOP Ontology\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 316 Subjects of type: aopo:AdverseOutcomePathway\n",
      "The AOP-Wiki RDF has 1131 Subjects of type: aopo:KeyEvent\n",
      "The AOP-Wiki RDF has 1363 Subjects of type: aopo:KeyEventRelationship\n",
      "The AOP-Wiki RDF has 124 Subjects of type: ncbitaxon:131567\n",
      "The AOP-Wiki RDF has 369 Subjects of type: go:0008150\n",
      "The AOP-Wiki RDF has 374 Subjects of type: pato:0001241\n",
      "The AOP-Wiki RDF has 0 Subjects of type: pato:0000001\n",
      "The AOP-Wiki RDF has 61 Subjects of type: aopo:CellTypeContext\n",
      "The AOP-Wiki RDF has 66 Subjects of type: aopo:OrganContext\n",
      "The AOP-Wiki RDF has 523 Subjects of type: nci:C54571\n",
      "The AOP-Wiki RDF has 329 Subjects of type: cheminf:000000\n"
     ]
    }
   ],
   "source": [
    "for item in coretypes:\n",
    "    sparqlquery = '''select (COUNT(DISTINCT ?subject) as ?Entity)  where {?subject a ''' + item + '''.}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" Subjects of type: \" + item)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All ontologies used for predicate annotation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:AdverseOutcomePathway subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#AopContext</td>\n",
       "      <td>82</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://aopkb.org/aop_ontology#LifeStageContext</td>\n",
       "      <td>151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_adverse_outcome</td>\n",
       "      <td>286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_evidence</td>\n",
       "      <td>71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_key_event</td>\n",
       "      <td>296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_key_event_relationship</td>\n",
       "      <td>275</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_molecular_initiating_event</td>\n",
       "      <td>268</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://edamontology.org/operation_3799</td>\n",
       "      <td>63</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25217</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25725</td>\n",
       "      <td>64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C48192</td>\n",
       "      <td>75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571</td>\n",
       "      <td>132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000047</td>\n",
       "      <td>165</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/creator</td>\n",
       "      <td>262</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>188</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>http://purl.org/dc/terms/abstract</td>\n",
       "      <td>173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>http://purl.org/dc/terms/alternative</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>http://purl.org/dc/terms/created</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>http://purl.org/dc/terms/modified</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#seeAlso</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                       predicate  \\\n",
       "0   http://aopkb.org/aop_ontology#AopContext                       \n",
       "1   http://aopkb.org/aop_ontology#LifeStageContext                 \n",
       "2   http://aopkb.org/aop_ontology#has_adverse_outcome              \n",
       "3   http://aopkb.org/aop_ontology#has_evidence                     \n",
       "4   http://aopkb.org/aop_ontology#has_key_event                    \n",
       "5   http://aopkb.org/aop_ontology#has_key_event_relationship       \n",
       "6   http://aopkb.org/aop_ontology#has_molecular_initiating_event   \n",
       "7   http://edamontology.org/operation_3799                         \n",
       "8   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25217      \n",
       "9   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25725      \n",
       "10  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C48192      \n",
       "11  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571      \n",
       "12  http://purl.obolibrary.org/obo/PATO_0000047                    \n",
       "13  http://purl.org/dc/elements/1.1/creator                        \n",
       "14  http://purl.org/dc/elements/1.1/description                    \n",
       "15  http://purl.org/dc/elements/1.1/identifier                     \n",
       "16  http://purl.org/dc/elements/1.1/source                         \n",
       "17  http://purl.org/dc/elements/1.1/title                          \n",
       "18  http://purl.org/dc/terms/abstract                              \n",
       "19  http://purl.org/dc/terms/alternative                           \n",
       "20  http://purl.org/dc/terms/created                               \n",
       "21  http://purl.org/dc/terms/modified                              \n",
       "22  http://www.w3.org/1999/02/22-rdf-syntax-ns#type                \n",
       "23  http://www.w3.org/2000/01/rdf-schema#label                     \n",
       "24  http://www.w3.org/2000/01/rdf-schema#seeAlso                   \n",
       "25  http://xmlns.com/foaf/0.1/page                                 \n",
       "\n",
       "   # of times used  \n",
       "0   82              \n",
       "1   151             \n",
       "2   286             \n",
       "3   71              \n",
       "4   296             \n",
       "5   275             \n",
       "6   268             \n",
       "7   63              \n",
       "8   79              \n",
       "9   64              \n",
       "10  75              \n",
       "11  132             \n",
       "12  165             \n",
       "13  262             \n",
       "14  188             \n",
       "15  316             \n",
       "16  316             \n",
       "17  316             \n",
       "18  173             \n",
       "19  316             \n",
       "20  316             \n",
       "21  316             \n",
       "22  316             \n",
       "23  316             \n",
       "24  316             \n",
       "25  316             "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:KeyEvent subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#CellTypeContext</td>\n",
       "      <td>352</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://aopkb.org/aop_ontology#LifeStageContext</td>\n",
       "      <td>203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://aopkb.org/aop_ontology#OrganContext</td>\n",
       "      <td>217</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://edamontology.org/data_1025</td>\n",
       "      <td>146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25664</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571</td>\n",
       "      <td>163</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/131567</td>\n",
       "      <td>291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0008150</td>\n",
       "      <td>611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MMO_0000000</td>\n",
       "      <td>350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000001</td>\n",
       "      <td>734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000047</td>\n",
       "      <td>203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0001241</td>\n",
       "      <td>545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>380</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://purl.org/dc/terms/alternative</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#seeAlso</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    predicate # of times used\n",
       "0   http://aopkb.org/aop_ontology#CellTypeContext              352           \n",
       "1   http://aopkb.org/aop_ontology#LifeStageContext             203           \n",
       "2   http://aopkb.org/aop_ontology#OrganContext                 217           \n",
       "3   http://edamontology.org/data_1025                          146           \n",
       "4   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25664  1131          \n",
       "5   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54571  163           \n",
       "6   http://purl.bioontology.org/ontology/NCBITAXON/131567      291           \n",
       "7   http://purl.obolibrary.org/obo/GO_0008150                  611           \n",
       "8   http://purl.obolibrary.org/obo/MMO_0000000                 350           \n",
       "9   http://purl.obolibrary.org/obo/PATO_0000001                734           \n",
       "10  http://purl.obolibrary.org/obo/PATO_0000047                203           \n",
       "11  http://purl.obolibrary.org/obo/PATO_0001241                545           \n",
       "12  http://purl.org/dc/elements/1.1/description                380           \n",
       "13  http://purl.org/dc/elements/1.1/identifier                 1131          \n",
       "14  http://purl.org/dc/elements/1.1/source                     1131          \n",
       "15  http://purl.org/dc/elements/1.1/title                      1131          \n",
       "16  http://purl.org/dc/terms/alternative                       1131          \n",
       "17  http://purl.org/dc/terms/isPartOf                          1131          \n",
       "18  http://www.w3.org/1999/02/22-rdf-syntax-ns#type            1131          \n",
       "19  http://www.w3.org/2000/01/rdf-schema#label                 1131          \n",
       "20  http://www.w3.org/2000/01/rdf-schema#seeAlso               1131          \n",
       "21  http://xmlns.com/foaf/0.1/page                             1131          "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:KeyEventRelationship subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#LifeStageContext</td>\n",
       "      <td>209</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_downstream_key_event</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_upstream_key_event</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://edamontology.org/data_1025</td>\n",
       "      <td>321</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://edamontology.org/data_2042</td>\n",
       "      <td>359</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C71478</td>\n",
       "      <td>313</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C80263</td>\n",
       "      <td>369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/131567</td>\n",
       "      <td>299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_0000047</td>\n",
       "      <td>215</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.org/dc/terms/created</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/dc/terms/modified</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#seeAlso</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    predicate # of times used\n",
       "0   http://aopkb.org/aop_ontology#LifeStageContext             209           \n",
       "1   http://aopkb.org/aop_ontology#has_downstream_key_event     1363          \n",
       "2   http://aopkb.org/aop_ontology#has_upstream_key_event       1363          \n",
       "3   http://edamontology.org/data_1025                          321           \n",
       "4   http://edamontology.org/data_2042                          359           \n",
       "5   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C71478  313           \n",
       "6   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C80263  369           \n",
       "7   http://purl.bioontology.org/ontology/NCBITAXON/131567      299           \n",
       "8   http://purl.obolibrary.org/obo/PATO_0000047                215           \n",
       "9   http://purl.org/dc/elements/1.1/description                370           \n",
       "10  http://purl.org/dc/elements/1.1/identifier                 1363          \n",
       "11  http://purl.org/dc/terms/created                           1363          \n",
       "12  http://purl.org/dc/terms/isPartOf                          1363          \n",
       "13  http://purl.org/dc/terms/modified                          1363          \n",
       "14  http://www.w3.org/1999/02/22-rdf-syntax-ns#type            1363          \n",
       "15  http://www.w3.org/2000/01/rdf-schema#label                 1363          \n",
       "16  http://www.w3.org/2000/01/rdf-schema#seeAlso               1363          \n",
       "17  http://xmlns.com/foaf/0.1/page                             1363          "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of ncbitaxon:131567 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>124</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       124           \n",
       "1  http://purl.org/dc/elements/1.1/source           124           \n",
       "2  http://purl.org/dc/elements/1.1/title            124           \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  124           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of go:0008150 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>369</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       369           \n",
       "1  http://purl.org/dc/elements/1.1/source           369           \n",
       "2  http://purl.org/dc/elements/1.1/title            369           \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  369           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of pato:0001241 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://www.w3.org/2004/02/skos/core#exactMatch</td>\n",
       "      <td>126</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       374           \n",
       "1  http://purl.org/dc/elements/1.1/source           374           \n",
       "2  http://purl.org/dc/elements/1.1/title            374           \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  374           \n",
       "4  http://www.w3.org/2004/02/skos/core#exactMatch   126           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of pato:0000001 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [predicate, # of times used]\n",
       "Index: []"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:CellTypeContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       61            \n",
       "1  http://purl.org/dc/elements/1.1/source           61            \n",
       "2  http://purl.org/dc/elements/1.1/title            61            \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  61            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of aopo:OrganContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier       66            \n",
       "1  http://purl.org/dc/elements/1.1/source           66            \n",
       "2  http://purl.org/dc/elements/1.1/title            66            \n",
       "3  http://www.w3.org/1999/02/22-rdf-syntax-ns#type  66            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of nci:C54571 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#has_chemical_entity</td>\n",
       "      <td>332</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/description</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.org/dc/terms/created</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.org/dc/terms/modified</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.w3.org/2000/01/rdf-schema#label</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://xmlns.com/foaf/0.1/page</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           predicate # of times used\n",
       "0  http://aopkb.org/aop_ontology#has_chemical_entity  332           \n",
       "1  http://purl.org/dc/elements/1.1/description        10            \n",
       "2  http://purl.org/dc/elements/1.1/identifier         523           \n",
       "3  http://purl.org/dc/elements/1.1/title              523           \n",
       "4  http://purl.org/dc/terms/created                   523           \n",
       "5  http://purl.org/dc/terms/isPartOf                  523           \n",
       "6  http://purl.org/dc/terms/modified                  523           \n",
       "7  http://www.w3.org/1999/02/22-rdf-syntax-ns#type    523           \n",
       "8  http://www.w3.org/2000/01/rdf-schema#label         523           \n",
       "9  http://xmlns.com/foaf/0.1/page                     523           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Predicates for triples of cheminf:000000 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>predicate</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/identifier</td>\n",
       "      <td>329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/source</td>\n",
       "      <td>329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.org/dc/elements/1.1/title</td>\n",
       "      <td>329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.org/dc/terms/alternative</td>\n",
       "      <td>277</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.org/dc/terms/isPartOf</td>\n",
       "      <td>329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_000059</td>\n",
       "      <td>320</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_000446</td>\n",
       "      <td>329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_000568</td>\n",
       "      <td>329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td>\n",
       "      <td>329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://www.w3.org/2004/02/skos/core#exactMatch</td>\n",
       "      <td>327</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            predicate # of times used\n",
       "0  http://purl.org/dc/elements/1.1/identifier          329           \n",
       "1  http://purl.org/dc/elements/1.1/source              329           \n",
       "2  http://purl.org/dc/elements/1.1/title               329           \n",
       "3  http://purl.org/dc/terms/alternative                277           \n",
       "4  http://purl.org/dc/terms/isPartOf                   329           \n",
       "5  http://semanticscience.org/resource/CHEMINF_000059  320           \n",
       "6  http://semanticscience.org/resource/CHEMINF_000446  329           \n",
       "7  http://semanticscience.org/resource/CHEMINF_000568  329           \n",
       "8  http://www.w3.org/1999/02/22-rdf-syntax-ns#type     329           \n",
       "9  http://www.w3.org/2004/02/skos/core#exactMatch      327           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "predicatedict = {}\n",
    "for item in coretypes:\n",
    "    predicates = pd.DataFrame(columns=['predicate','# of times used'])\n",
    "    sparqlquery = '''select distinct ?predicate (COUNT(distinct ?subject) as ?Entity)  where {?subject ?predicate ?object; a '''+item+'''.}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "    print(\"Predicates for triples of \"+item+\" subjects\")\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        predicates = predicates.append({\n",
    "            '# of times used' : result[\"Entity\"][\"value\"],\n",
    "            'predicate' : result[\"predicate\"][\"value\"],\n",
    "           # 'Chemical': result[\"Chemical\"][\"value\"] if ('Chemical' in result'),\n",
    "        }, ignore_index=True)\n",
    "        if not item in predicatedict:\n",
    "            predicatedict[item] = int(result[\"Entity\"][\"value\"])\n",
    "        else:\n",
    "            predicatedict[item] += int(result[\"Entity\"][\"value\"])\n",
    "    display(predicates.sort_values(by=['predicate']).reset_index(drop=True))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All predicate annotations combined"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>subject</th>\n",
       "      <th>number of properties</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>aopo:AdverseOutcomePathway</td>\n",
       "      <td>5790</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>aopo:CellTypeContext</td>\n",
       "      <td>244</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>aopo:KeyEvent</td>\n",
       "      <td>15505</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>aopo:KeyEventRelationship</td>\n",
       "      <td>16085</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>aopo:OrganContext</td>\n",
       "      <td>264</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>cheminf:000000</td>\n",
       "      <td>3227</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>go:0008150</td>\n",
       "      <td>1476</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ncbitaxon:131567</td>\n",
       "      <td>496</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>nci:C54571</td>\n",
       "      <td>4526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>pato:0001241</td>\n",
       "      <td>1622</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      subject  number of properties\n",
       "0  aopo:AdverseOutcomePathway  5790                \n",
       "1  aopo:CellTypeContext        244                 \n",
       "2  aopo:KeyEvent               15505               \n",
       "3  aopo:KeyEventRelationship   16085               \n",
       "4  aopo:OrganContext           264                 \n",
       "5  cheminf:000000              3227                \n",
       "6  go:0008150                  1476                \n",
       "7  ncbitaxon:131567            496                 \n",
       "8  nci:C54571                  4526                \n",
       "9  pato:0001241                1622                "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "predicatedf = pd.DataFrame(list(predicatedict.items()), columns=['subject', 'number of properties']).sort_values(by=['subject']).reset_index(drop=True)\n",
    "display(predicatedf)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All ontologies used for object annotation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:AdverseOutcomePathway subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>316</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           object # of times used\n",
       "0  http://aopkb.org/aop_ontology#  316           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:KeyEvent subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>1131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>504</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_</td>\n",
       "      <td>151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>418</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_</td>\n",
       "      <td>540</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MI_</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/NBO_</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PR_</td>\n",
       "      <td>203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.obolibrary.org/obo/VT_</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>139</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.org/sig/ont/fma/fma</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             object # of times used\n",
       "0   http://aopkb.org/aop_ontology#                   1131          \n",
       "1   http://purl.bioontology.org/ontology/NCBITAXON/  504           \n",
       "2   http://purl.obolibrary.org/obo/CHEBI_            151           \n",
       "3   http://purl.obolibrary.org/obo/CL_               418           \n",
       "4   http://purl.obolibrary.org/obo/GO_               540           \n",
       "5   http://purl.obolibrary.org/obo/HP_               10            \n",
       "6   http://purl.obolibrary.org/obo/MI_               6             \n",
       "7   http://purl.obolibrary.org/obo/MP_               77            \n",
       "8   http://purl.obolibrary.org/obo/NBO_              11            \n",
       "9   http://purl.obolibrary.org/obo/PCO_              10            \n",
       "10  http://purl.obolibrary.org/obo/PR_               203           \n",
       "11  http://purl.obolibrary.org/obo/UBERON_           261           \n",
       "12  http://purl.obolibrary.org/obo/VT_               9             \n",
       "13  http://purl.org/commons/record/mesh/             139           \n",
       "14  http://purl.org/sig/ont/fma/fma                  14            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:KeyEventRelationship subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>1363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>400</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            object # of times used\n",
       "0  http://aopkb.org/aop_ontology#                   1363          \n",
       "1  http://purl.bioontology.org/ontology/NCBITAXON/  400           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of ncbitaxon:131567 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>248</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            object # of times used\n",
       "0  http://purl.bioontology.org/ontology/NCBITAXON/  248           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of go:0008150 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_</td>\n",
       "      <td>631</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MI_</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>53</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/NBO_</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/VT_</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 object # of times used\n",
       "0  http://purl.obolibrary.org/obo/GO_    631           \n",
       "1  http://purl.obolibrary.org/obo/HP_    8             \n",
       "2  http://purl.obolibrary.org/obo/MI_    4             \n",
       "3  http://purl.obolibrary.org/obo/MP_    53            \n",
       "4  http://purl.obolibrary.org/obo/NBO_   8             \n",
       "5  http://purl.obolibrary.org/obo/PATO_  5             \n",
       "6  http://purl.obolibrary.org/obo/PCO_   1             \n",
       "7  http://purl.obolibrary.org/obo/VT_    7             \n",
       "8  http://purl.org/commons/record/mesh/  26            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of pato:0001241 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_</td>\n",
       "      <td>72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PR_</td>\n",
       "      <td>142</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.org/sig/ont/fma/fma</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    object # of times used\n",
       "0   http://aopkb.org/aop_ontology#          42            \n",
       "1   http://purl.obolibrary.org/obo/CHEBI_   72            \n",
       "2   http://purl.obolibrary.org/obo/CL_      40            \n",
       "3   http://purl.obolibrary.org/obo/GO_      29            \n",
       "4   http://purl.obolibrary.org/obo/MP_      1             \n",
       "5   http://purl.obolibrary.org/obo/PATO_    374           \n",
       "6   http://purl.obolibrary.org/obo/PCO_     2             \n",
       "7   http://purl.obolibrary.org/obo/PR_      142           \n",
       "8   http://purl.obolibrary.org/obo/UBERON_  36            \n",
       "9   http://purl.org/commons/record/mesh/    47            \n",
       "10  http://purl.org/sig/ont/fma/fma         10            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of pato:0000001 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [object, # of times used]\n",
       "Index: []"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:CellTypeContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>61</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 object # of times used\n",
       "0  http://aopkb.org/aop_ontology#        61            \n",
       "1  http://purl.obolibrary.org/obo/CL_    61            \n",
       "2  http://purl.obolibrary.org/obo/PATO_  26            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of aopo:OrganContext subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   object # of times used\n",
       "0  http://aopkb.org/aop_ontology#          66            \n",
       "1  http://purl.obolibrary.org/obo/PATO_    16            \n",
       "2  http://purl.obolibrary.org/obo/UBERON_  66            "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of nci:C54571 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                object # of times used\n",
       "0  http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#  523           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "objects for triples of cheminf:000000 subjects\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th># of times used</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_</td>\n",
       "      <td>658</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         object # of times used\n",
       "0  http://semanticscience.org/resource/CHEMINF_  658           "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "objectdict = {}\n",
    "for item in coretypes:\n",
    "    objects = pd.DataFrame(columns=['object','# of times used'])\n",
    "    print(\"objects for triples of \"+item+\" subjects\")\n",
    "    for onto in ontologies:\n",
    "        n=0\n",
    "        sparqlquery = '''select (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object; a '''+item+'''. FILTER regex(?object, \"'''+onto+'''\")}'''\n",
    "        AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "        results = AOPWikiSPARQL.query().convert()\n",
    "        \n",
    "        for result in results[\"results\"][\"bindings\"]:\n",
    "            n+=int(result[\"Entity\"][\"value\"])\n",
    "            \n",
    "            \n",
    "        if n != 0:\n",
    "            objects = objects.append({\n",
    "                '# of times used' : n,\n",
    "                'object' : onto,\n",
    "               # 'Chemical': result[\"Chemical\"][\"value\"] if ('Chemical' in result'),\n",
    "            }, ignore_index=True)\n",
    "            if not onto in objectdict:\n",
    "                objectdict[onto] = n\n",
    "            else:\n",
    "                objectdict[onto] += n\n",
    "    display(objects.sort_values(by=['object']).reset_index(drop=True))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### All object annotations combined"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object</th>\n",
       "      <th>number</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://aopkb.org/aop_ontology#</td>\n",
       "      <td>2979</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#</td>\n",
       "      <td>523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.bioontology.org/ontology/NCBITAXON/</td>\n",
       "      <td>1152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_</td>\n",
       "      <td>223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_</td>\n",
       "      <td>519</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_</td>\n",
       "      <td>1200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MI_</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MP_</td>\n",
       "      <td>131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.obolibrary.org/obo/NBO_</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PATO_</td>\n",
       "      <td>421</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PCO_</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://purl.obolibrary.org/obo/PR_</td>\n",
       "      <td>345</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://purl.obolibrary.org/obo/UBERON_</td>\n",
       "      <td>363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://purl.obolibrary.org/obo/VT_</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://purl.org/commons/record/mesh/</td>\n",
       "      <td>212</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://purl.org/sig/ont/fma/fma</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://semanticscience.org/resource/CHEMINF_</td>\n",
       "      <td>658</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 object  number\n",
       "0   http://aopkb.org/aop_ontology#                       2979  \n",
       "1   http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#  523   \n",
       "2   http://purl.bioontology.org/ontology/NCBITAXON/      1152  \n",
       "3   http://purl.obolibrary.org/obo/CHEBI_                223   \n",
       "4   http://purl.obolibrary.org/obo/CL_                   519   \n",
       "5   http://purl.obolibrary.org/obo/GO_                   1200  \n",
       "6   http://purl.obolibrary.org/obo/HP_                   18    \n",
       "7   http://purl.obolibrary.org/obo/MI_                   10    \n",
       "8   http://purl.obolibrary.org/obo/MP_                   131   \n",
       "9   http://purl.obolibrary.org/obo/NBO_                  19    \n",
       "10  http://purl.obolibrary.org/obo/PATO_                 421   \n",
       "11  http://purl.obolibrary.org/obo/PCO_                  13    \n",
       "12  http://purl.obolibrary.org/obo/PR_                   345   \n",
       "13  http://purl.obolibrary.org/obo/UBERON_               363   \n",
       "14  http://purl.obolibrary.org/obo/VT_                   16    \n",
       "15  http://purl.org/commons/record/mesh/                 212   \n",
       "16  http://purl.org/sig/ont/fma/fma                      24    \n",
       "17  http://semanticscience.org/resource/CHEMINF_         658   "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "objectdf = pd.DataFrame(list(objectdict.items()), columns=['object', 'number']).sort_values(by=['object']).reset_index(drop=True)\n",
    "display(objectdf)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 4: Identifier usage in the core AOP-Wiki RDF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 115591 subjects with a persistent identifier\n",
      "The AOP-Wiki RDF has 0 predicates with a persistent identifier\n",
      "The AOP-Wiki RDF has 36338 objects with a persistent identifier\n"
     ]
    }
   ],
   "source": [
    "for item in triple:\n",
    "    sparqlquery = '''select (COUNT(?''' + item + ''') as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?''' + item + ''', \"https://identifiers.org/\")}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" \" + item + \"s with a persistent identifier\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### BridgeDb mappings for chemical identifiers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BridgeDb has mapped chemicals with identifiers from 9 distinct databases\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select distinct ?type where {?s a cheminf:000000; skos:exactMatch ?o. ?o a ?type}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "y = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    y.append(result[\"type\"][\"value\"])\n",
    "\n",
    "print(\"BridgeDb has mapped chemicals with identifiers from \" + str(len(y)) + \" distinct databases\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 803 chemicals mapped using BridgeDb of type: ChEBI identifier\n",
      "The AOP-Wiki RDF has 287 chemicals mapped using BridgeDb of type: ChEMBL identifier\n",
      "The AOP-Wiki RDF has 343 chemicals mapped using BridgeDb of type: ChemSpider identifier\n",
      "The AOP-Wiki RDF has 161 chemicals mapped using BridgeDb of type: DrugBank identifier\n",
      "The AOP-Wiki RDF has 363 chemicals mapped using BridgeDb of type: HMDB identifier\n",
      "The AOP-Wiki RDF has 264 chemicals mapped using BridgeDb of type: KEGG identifier\n",
      "The AOP-Wiki RDF has 30 chemicals mapped using BridgeDb of type: LipidMaps identifier\n",
      "The AOP-Wiki RDF has 338 chemicals mapped using BridgeDb of type: PubChem compound identifier (CID)\n",
      "The AOP-Wiki RDF has 328 chemicals mapped using BridgeDb of type: Wikidata identifier\n"
     ]
    }
   ],
   "source": [
    "for item in y:\n",
    "    sparqlquery = '''select (COUNT(?subject) as ?Entity) ?item  where {?subject a <''' + item + '''>.  <''' + item + '''> rdfs:label ?item }'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "        z = result[\"item\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" chemicals mapped using BridgeDb of type: \" + z)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Protein Ontology mappings to gene/protein identifiers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 166 Key Events that are annotated with 126 Protein Ontology annotation, which are mapped to gene identifiers from 4 distinct databases\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select distinct ?s0 ?s ?type where {?s0 a aopo:KeyEvent; pato:0001241 ?s. ?s a pato:0001241; skos:exactMatch ?o. ?o a ?type}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "y = []\n",
    "x = []\n",
    "z = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    y.append(result[\"type\"][\"value\"])\n",
    "    x.append(result[\"s\"][\"value\"])\n",
    "    z.append(result[\"s0\"][\"value\"])\n",
    "y = set(y)\n",
    "x = set(x)\n",
    "z = set(z)\n",
    "print(\"The AOP-Wiki RDF has \" + str(len(z)) + \" Key Events that are annotated with \" + str(len(x)) + \" Protein Ontology annotation, which are mapped to gene identifiers from \" + str(len(y)) + \" distinct databases\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has 447 genes mapped to Protein Ontology terms for database identifier type: UniProt ID\n",
      "The AOP-Wiki RDF has 576 genes mapped to Protein Ontology terms for database identifier type: Gene identifier\n",
      "The AOP-Wiki RDF has 32 genes mapped to Protein Ontology terms for database identifier type: Gene ID (NCBI)\n",
      "The AOP-Wiki RDF has 97 genes mapped to Protein Ontology terms for database identifier type: Gene ID (HGNC)\n"
     ]
    }
   ],
   "source": [
    "for item in y:\n",
    "    sparqlquery = '''select (COUNT(distinct ?s2) as ?Entity) ?label where {?s a pato:0001241; skos:exactMatch ?s2. ?s2 ?p ?o; a <''' + item + '''>. <''' + item + '''> rdfs:label ?label}'''\n",
    "    AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "    results = AOPWikiSPARQL.query().convert()\n",
    "\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        x = result[\"Entity\"][\"value\"]\n",
    "        z = result[\"label\"][\"value\"]\n",
    "\n",
    "    print(\"The AOP-Wiki RDF has \" + str(x) + \" genes mapped to Protein Ontology terms for database identifier type: \" + z)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Section 5: Additional text-mapped genes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The AOP-Wiki RDF has a total of 298 distinct genes mapped to 146 Key Event descriptions\n",
      "The AOP-Wiki RDF has a total of 746 distinct genes mapped to 321 Key Event Relationship descriptions\n",
      "There are 198 genes mapped at least once to both Key Events and Key Event Relationships\n",
      "There are 846 unique genes mapped to Key Events and/or Key Event Relationships\n"
     ]
    }
   ],
   "source": [
    "sparqlquery = '''select distinct ?s ?s2 where {?s a aopo:KeyEvent; edam:data_1025 ?s2.}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "y = []\n",
    "z = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    y.append(result[\"s2\"][\"value\"])\n",
    "    z.append(result[\"s\"][\"value\"])\n",
    "y = set(y)\n",
    "z = set(z)\n",
    "\n",
    "sparqlquery = '''select distinct ?s ?s2 where {?s a aopo:KeyEventRelationship; edam:data_1025 ?s2.}'''\n",
    "AOPWikiSPARQL.setQuery(sparqlquery)\n",
    "results = AOPWikiSPARQL.query().convert()\n",
    "w = []\n",
    "x = []\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    w.append(result[\"s2\"][\"value\"])\n",
    "    x.append(result[\"s\"][\"value\"])\n",
    "w = set(w)\n",
    "x = set(x)\n",
    "\n",
    "print(\"The AOP-Wiki RDF has a total of \" + str(len(y)) + \" distinct genes mapped to \" + str(len(z)) + \" Key Event descriptions\")\n",
    "print(\"The AOP-Wiki RDF has a total of \" + str(len(w)) + \" distinct genes mapped to \" + str(len(x)) + \" Key Event Relationship descriptions\")\n",
    "print(\"There are \" + str(len(intersection(w,y))) + \" genes mapped at least once to both Key Events and Key Event Relationships\")\n",
    "print(\"There are \" + str(len(w|y)) + \" unique genes mapped to Key Events and/or Key Event Relationships\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "invalid syntax (<ipython-input-69-f3b3f004ca14>, line 2)",
     "output_type": "error",
     "traceback": [
      "\u001b[0;36m  File \u001b[0;32m\"<ipython-input-69-f3b3f004ca14>\"\u001b[0;36m, line \u001b[0;32m2\u001b[0m\n\u001b[0;31m    select (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object.FILTER regex(?predicate, \"http://purl.org/dc/\")}\u001b[0m\n\u001b[0m                  ^\u001b[0m\n\u001b[0;31mSyntaxError\u001b[0m\u001b[0;31m:\u001b[0m invalid syntax\n"
     ]
    }
   ],
   "source": [
    "#Dublin core\n",
    "select (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object.FILTER regex(?predicate, \"http://purl.org/dc/\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# a\n",
    "select  (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"http://www.w3.org/1999/02/22-rdf-syntax-ns\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#rdf schema\n",
    "select  (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"http://www.w3.org/2000/01/rdf-schema\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# foaf\n",
    "select  (COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"http://xmlns.com/foaf/0.1\")}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#aopo predicate\n",
    "select  distinct ?predicate \n",
    "(COUNT(?object) as ?Entity)  where {?subject ?predicate ?object. FILTER regex(?predicate, \"ttp://aopkb.org/aop_ontology#\")}"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
